node {
  name: "init"
  op: "NoOp"
}
node {
  name: "global/Input_States"
  op: "Placeholder"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 31
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 31
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/random_uniform/shape"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\037\000\000\000\377\000\000\000"
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/random_uniform/min"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.14484135806560516
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/random_uniform/max"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.14484135806560516
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global/_fully_connected_Layer_1/random_uniform/shape"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 31
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/random_uniform/sub"
  op: "Sub"
  input: "global/_fully_connected_Layer_1/random_uniform/max"
  input: "global/_fully_connected_Layer_1/random_uniform/min"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/random_uniform/mul"
  op: "Mul"
  input: "global/_fully_connected_Layer_1/random_uniform/RandomUniform"
  input: "global/_fully_connected_Layer_1/random_uniform/sub"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 31
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/random_uniform"
  op: "Add"
  input: "global/_fully_connected_Layer_1/random_uniform/mul"
  input: "global/_fully_connected_Layer_1/random_uniform/min"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 31
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/Weights"
  op: "VariableV2"
  device: "/job:master/task:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 31
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 31
        }
        dim {
          size: 255
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/Weights/Assign"
  op: "Assign"
  input: "global/_fully_connected_Layer_1/Weights"
  input: "global/_fully_connected_Layer_1/random_uniform"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_1/Weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 31
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/Weights/read"
  op: "Identity"
  input: "global/_fully_connected_Layer_1/Weights"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_1/Weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 31
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/Const"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 255
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/Bias"
  op: "VariableV2"
  device: "/job:master/task:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 255
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/Bias/Assign"
  op: "Assign"
  input: "global/_fully_connected_Layer_1/Bias"
  input: "global/_fully_connected_Layer_1/Const"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_1/Bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/Bias/read"
  op: "Identity"
  input: "global/_fully_connected_Layer_1/Bias"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_1/Bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/MatMul"
  op: "MatMul"
  input: "global/Input_States"
  input: "global/_fully_connected_Layer_1/Weights/read"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/add"
  op: "AddV2"
  input: "global/_fully_connected_Layer_1/MatMul"
  input: "global/_fully_connected_Layer_1/Bias/read"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_1/Relu"
  op: "Relu"
  input: "global/_fully_connected_Layer_1/add"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/random_uniform/shape"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\000\000\000\377\000\000\000"
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/random_uniform/min"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.10846523195505142
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/random_uniform/max"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10846523195505142
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global/_fully_connected_Layer_2/random_uniform/shape"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/random_uniform/sub"
  op: "Sub"
  input: "global/_fully_connected_Layer_2/random_uniform/max"
  input: "global/_fully_connected_Layer_2/random_uniform/min"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/random_uniform/mul"
  op: "Mul"
  input: "global/_fully_connected_Layer_2/random_uniform/RandomUniform"
  input: "global/_fully_connected_Layer_2/random_uniform/sub"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/random_uniform"
  op: "Add"
  input: "global/_fully_connected_Layer_2/random_uniform/mul"
  input: "global/_fully_connected_Layer_2/random_uniform/min"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/Weights"
  op: "VariableV2"
  device: "/job:master/task:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 255
        }
        dim {
          size: 255
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/Weights/Assign"
  op: "Assign"
  input: "global/_fully_connected_Layer_2/Weights"
  input: "global/_fully_connected_Layer_2/random_uniform"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_2/Weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/Weights/read"
  op: "Identity"
  input: "global/_fully_connected_Layer_2/Weights"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_2/Weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/Const"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 255
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/Bias"
  op: "VariableV2"
  device: "/job:master/task:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 255
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/Bias/Assign"
  op: "Assign"
  input: "global/_fully_connected_Layer_2/Bias"
  input: "global/_fully_connected_Layer_2/Const"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_2/Bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/Bias/read"
  op: "Identity"
  input: "global/_fully_connected_Layer_2/Bias"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_2/Bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/MatMul"
  op: "MatMul"
  input: "global/_fully_connected_Layer_1/Relu"
  input: "global/_fully_connected_Layer_2/Weights/read"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/add"
  op: "AddV2"
  input: "global/_fully_connected_Layer_2/MatMul"
  input: "global/_fully_connected_Layer_2/Bias/read"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_2/Relu"
  op: "Relu"
  input: "global/_fully_connected_Layer_2/add"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/random_uniform/shape"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\000\000\000\377\000\000\000"
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/random_uniform/min"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.10846523195505142
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/random_uniform/max"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10846523195505142
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global/_fully_connected_Layer_3/random_uniform/shape"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/random_uniform/sub"
  op: "Sub"
  input: "global/_fully_connected_Layer_3/random_uniform/max"
  input: "global/_fully_connected_Layer_3/random_uniform/min"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/random_uniform/mul"
  op: "Mul"
  input: "global/_fully_connected_Layer_3/random_uniform/RandomUniform"
  input: "global/_fully_connected_Layer_3/random_uniform/sub"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/random_uniform"
  op: "Add"
  input: "global/_fully_connected_Layer_3/random_uniform/mul"
  input: "global/_fully_connected_Layer_3/random_uniform/min"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/Weights"
  op: "VariableV2"
  device: "/job:master/task:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 255
        }
        dim {
          size: 255
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/Weights/Assign"
  op: "Assign"
  input: "global/_fully_connected_Layer_3/Weights"
  input: "global/_fully_connected_Layer_3/random_uniform"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_3/Weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/Weights/read"
  op: "Identity"
  input: "global/_fully_connected_Layer_3/Weights"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_3/Weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/Const"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 255
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/Bias"
  op: "VariableV2"
  device: "/job:master/task:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 255
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/Bias/Assign"
  op: "Assign"
  input: "global/_fully_connected_Layer_3/Bias"
  input: "global/_fully_connected_Layer_3/Const"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_3/Bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/Bias/read"
  op: "Identity"
  input: "global/_fully_connected_Layer_3/Bias"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_3/Bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/MatMul"
  op: "MatMul"
  input: "global/_fully_connected_Layer_2/Relu"
  input: "global/_fully_connected_Layer_3/Weights/read"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/add"
  op: "AddV2"
  input: "global/_fully_connected_Layer_3/MatMul"
  input: "global/_fully_connected_Layer_3/Bias/read"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_3/Relu"
  op: "Relu"
  input: "global/_fully_connected_Layer_3/add"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/random_uniform/shape"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\000\000\000\377\000\000\000"
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/random_uniform/min"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.10846523195505142
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/random_uniform/max"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.10846523195505142
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "global/_fully_connected_Layer_4/random_uniform/shape"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 0
    }
  }
  attr {
    key: "seed2"
    value {
      i: 0
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/random_uniform/sub"
  op: "Sub"
  input: "global/_fully_connected_Layer_4/random_uniform/max"
  input: "global/_fully_connected_Layer_4/random_uniform/min"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/random_uniform/mul"
  op: "Mul"
  input: "global/_fully_connected_Layer_4/random_uniform/RandomUniform"
  input: "global/_fully_connected_Layer_4/random_uniform/sub"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/random_uniform"
  op: "Add"
  input: "global/_fully_connected_Layer_4/random_uniform/mul"
  input: "global/_fully_connected_Layer_4/random_uniform/min"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/Weights"
  op: "VariableV2"
  device: "/job:master/task:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 255
        }
        dim {
          size: 255
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/Weights/Assign"
  op: "Assign"
  input: "global/_fully_connected_Layer_4/Weights"
  input: "global/_fully_connected_Layer_4/random_uniform"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_4/Weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/Weights/read"
  op: "Identity"
  input: "global/_fully_connected_Layer_4/Weights"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_4/Weights"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/Const"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 255
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/Bias"
  op: "VariableV2"
  device: "/job:master/task:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 255
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/Bias/Assign"
  op: "Assign"
  input: "global/_fully_connected_Layer_4/Bias"
  input: "global/_fully_connected_Layer_4/Const"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_4/Bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/Bias/read"
  op: "Identity"
  input: "global/_fully_connected_Layer_4/Bias"
  device: "/job:master/task:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global/_fully_connected_Layer_4/Bias"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/MatMul"
  op: "MatMul"
  input: "global/_fully_connected_Layer_3/Relu"
  input: "global/_fully_connected_Layer_4/Weights/read"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/add"
  op: "AddV2"
  input: "global/_fully_connected_Layer_4/MatMul"
  input: "global/_fully_connected_Layer_4/Bias/read"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/_fully_connected_Layer_4/Relu"
  op: "Relu"
  input: "global/_fully_connected_Layer_4/add"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/Reshape/shape"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\377\377\377\377\377\000\000\000"
      }
    }
  }
}
node {
  name: "global/Reshape"
  op: "Reshape"
  input: "global/_fully_connected_Layer_4/Relu"
  input: "global/Reshape/shape"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tshape"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/Placeholder"
  op: "Placeholder"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 256
        }
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/Placeholder_1"
  op: "Placeholder"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 256
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 1
        }
        dim {
          size: 256
        }
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/Shape"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\377\000\000\000"
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/strided_slice/stack"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/strided_slice/stack_1"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/strided_slice/stack_2"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/strided_slice"
  op: "StridedSlice"
  input: "global/LSTM_Layer/Shape"
  input: "global/LSTM_Layer/strided_slice/stack"
  input: "global/LSTM_Layer/strided_slice/stack_1"
  input: "global/LSTM_Layer/strided_slice/stack_2"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "global/LSTM_Layer/ExpandDims/dim"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/ExpandDims"
  op: "ExpandDims"
  input: "global/Reshape"
  input: "global/LSTM_Layer/ExpandDims/dim"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/Rank"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 3
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/range/start"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/range/delta"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/range"
  op: "Range"
  input: "global/LSTM_Layer/rnn/range/start"
  input: "global/LSTM_Layer/rnn/Rank"
  input: "global/LSTM_Layer/rnn/range/delta"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/concat/values_0"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/concat/axis"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/concat"
  op: "ConcatV2"
  input: "global/LSTM_Layer/rnn/concat/values_0"
  input: "global/LSTM_Layer/rnn/range"
  input: "global/LSTM_Layer/rnn/concat/axis"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 3
          }
        }
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/transpose"
  op: "Transpose"
  input: "global/LSTM_Layer/ExpandDims"
  input: "global/LSTM_Layer/rnn/concat"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
          dim {
            size: 1
          }
          dim {
            size: 255
          }
        }
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/sequence_length"
  op: "Identity"
  input: "global/LSTM_Layer/strided_slice"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/Shape"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "global/LSTM_Layer/rnn/stack"
  op: "Const"
  device: "/job:thread/task:0/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 1
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
